---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SolutionIsOppositeToConnectionWarning
source: html/431a80b9-3c62-b1b0-51bb-38aed8eeca0f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SolutionIsOppositeToConnectionWarning Property

The solution is in the opposite direction of the connection direction.

## Syntax (C#)
```csharp
public static FailureDefinitionId SolutionIsOppositeToConnectionWarning { get; }
```